app/views/api/v1/users/show.json.jbuilder

INSERT INTO "users" ("name", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Callum"], ["avatar", "http://yo"], ["created_at", "2018-08-07 10:22:35.228085"], ["updated_at", "2018-08-07 10:22:35.228085"]]
---
json.extract! @user, :id, :name, :avatar
json.date @user.created_at.strftime("%m/%d/%y")