app/controllers/api/v1/posts_controller.rb

  def create
    p "creating............................"
    p params.inspect
    p params['user_id']
    @post = Post.new(post_params)
    @post.user = User.find(params['user_id'])
    @post.date = Date.today
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "posts" ("content", "date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Gee just create a post"], ["date", "2018-08-08"], ["user_id", 1], ["created_at", "2018-08-08 10:15:19.178412"], ["updated_at", "2018-08-08 10:15:19.178412"]]