app/controllers/api/v1/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "callum"], ["avatar", "http//dsdsd"], ["created_at", "2018-08-09 13:49:33.001928"], ["updated_at", "2018-08-09 13:49:33.001928"]]

  def login
    @user = User.find_or_create_by(open_id: wechat_user.fetch("openid"))
---
SELECT  "users".* FROM "users" WHERE "users"."open_id" = $1 LIMIT $2  [["open_id", "os0eW5BaNaXfow43ql2L6ugZggkI"], ["LIMIT", 1]]